2018/python-new-instance.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-03-11 周一 21:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 构造对象实例</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 构造对象实例</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb64f150">1. 前言</a></li>
<li><a href="#org51fdb5f">2. 使用</a></li>
<li><a href="#org06a6723">3. 关系</a></li>
<li><a href="#org4fef4b6">4. 元类</a></li>
<li><a href="#org4fafbd1">5. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb64f150" class="outline-2">
<h2 id="orgb64f150"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>Python</code> 中我们常用的一个特殊方法为 <code>__init__</code>, 曾经， 我认为这个方法是用于构造对象实例的方法。
</p>

<p>
但是， 后来我发现， 还有一个特殊方法 <code>__new__</code>, 它的执行顺序还在 <code>__init__</code> 前面。
</p>

<p>
如果 <code>__init__</code> 就是构造实例的方法的话， 怎么还会有方法在它之前执行呢 ？
</p>

<p>
一番查阅后， 我明白了， 方法 <code>__new__</code> 才是构造对象实例的方法， 而 <code>__init__</code>, 只不过是对象实例构造完成后初始化
<b>实例属性</b> 的方法而已。
</p>

<p>
现在， 需要关心的是 <code>__new__</code> 和 <code>__init__</code> 的使用以及两者之间的关系。
</p>
</div>
</div>

<div id="outline-container-org51fdb5f" class="outline-2">
<h2 id="org51fdb5f"><span class="section-number-2">2</span> 使用</h2>
<div class="outline-text-2" id="text-2">
<p>
对于 <code>__init__</code>, 相信只要使用过 <code>Python</code>, 应该都不陌生， 其一般形式为：
</p>
<div class="org-src-container">
<pre class="src src-python">__init__(<span class="org-keyword">self</span>, *args, **kwargs)
</pre>
</div>

<p>
而 <code>__init__</code> 的使用， 相信不需要我来说明了， 这次的重点还是放到 <code>__new__</code> 上：
</p>
<div class="org-src-container">
<pre class="src src-python">__new__(cls, *args, **kwargs)
</pre>
</div>

<p>
对于 <code>__new__</code> 来说， 只有参数 <code>cls</code> 是必需的， <code>cls</code> 代表的是当前要构造的对象实例的 <b>类型</b>.
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">Example</span>(<span class="org-builtin">object</span>):
    <span class="org-keyword">def</span> <span class="org-function-name">__new__</span>(cls):
        <span class="org-keyword">print</span>(cls)

<span class="org-keyword">print</span>(Example)
Example()

<span class="org-comment-delimiter"># </span><span class="org-comment">&lt;class '__main__.Example'&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&lt;class '__main__.Example'&gt;</span>
</pre>
</div>

<p>
通过上述代码可以更直观的看到， <code>cls</code> 代表的其实就是 <code>Example</code> 这个类。
</p>

<p>
<code>__new__</code> 和 <code>__init__</code> 在使用上来说， 其实区别不大， 两者的主要区别在于第一个参数， 一个是 <b>类</b>, 一个是 <b>实例</b>.
</p>

<p>
虽然大多数时候都不会有需要重写 <code>__new__</code> 方法的时候， 但是， 假如遇到了这种情况， 那么还是需要注意一个问题， 那就是
<b>构造实例</b>.
</p>

<p>
很明显， 当前类的 <code>__new__</code> 被覆盖了， 我们不能再调用当前类的 <code>__new__</code> 来构造实例， 因此， 在 <code>__new__</code> 中构造实例， 需要借助 <code>super()</code> 的帮助：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">Example1</span>(<span class="org-builtin">object</span>):
    <span class="org-keyword">def</span> <span class="org-function-name">__new__</span>(cls):
        <span class="org-keyword">return</span> <span class="org-builtin">super</span>(Example1, cls).__new__(cls)


<span class="org-keyword">class</span> <span class="org-type">Example2</span>(<span class="org-builtin">object</span>):
    <span class="org-keyword">def</span> <span class="org-function-name">__new__</span>(cls):
        <span class="org-keyword">pass</span>


<span class="org-keyword">print</span>(<span class="org-string">'For Example1: %s'</span> % Example1())
<span class="org-keyword">print</span>(<span class="org-string">'For Example2: %s'</span> % Example2())

<span class="org-comment-delimiter"># </span><span class="org-comment">For Example1: &lt;__main__.Example1 object at 0x021B36B0&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">For Example2: None</span>
</pre>
</div>

<p>
<b>注意:</b> 请记得把构造出来的实例返回， 有用的 (｀・ω・´)
</p>
</div>
</div>

<div id="outline-container-org06a6723" class="outline-2">
<h2 id="org06a6723"><span class="section-number-2">3</span> 关系</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>__new__</code> 和 <code>__init__</code> 两者之间存在很紧密的关系， 简单的概括一下就是：
</p>

<ul class="org-ul">
<li><code>__new__</code> 的返回值是 <code>__init__</code> 的参数</li>
</ul>

<p>
具体的执行过程可以看一下 <code>cpython</code> 中对应的源码：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-keyword">static</span> <span class="org-type">PyObject</span> *
<span class="org-function-name">type_call</span>(<span class="org-type">PyTypeObject</span> *<span class="org-variable-name">type</span>, <span class="org-type">PyObject</span> *<span class="org-variable-name">args</span>, <span class="org-type">PyObject</span> *<span class="org-variable-name">kwds</span>)
{
    <span class="org-type">PyObject</span> *<span class="org-variable-name">obj</span>;

    <span class="org-keyword">if</span> (type-&gt;tp_new == <span class="org-constant">NULL</span>) {
        PyErr_Format(PyExc_TypeError,
                     <span class="org-string">"cannot create '%.100s' instances"</span>,
                     type-&gt;tp_name);
        <span class="org-keyword">return</span> <span class="org-constant">NULL</span>;
    }

    obj = type-&gt;tp_new(type, args, kwds);
    obj = _Py_CheckFunctionResult((<span class="org-type">PyObject</span>*)type, obj, <span class="org-constant">NULL</span>);
    <span class="org-keyword">if</span> (obj == <span class="org-constant">NULL</span>)
        <span class="org-keyword">return</span> <span class="org-constant">NULL</span>;

    <span class="org-comment-delimiter">/* </span><span class="org-comment">Ugly exception: when the call was type(something),</span>
<span class="org-comment">       don't call tp_init on the result. </span><span class="org-comment-delimiter">*/</span>
    <span class="org-keyword">if</span> (type == &amp;PyType_Type &amp;&amp;
        PyTuple_Check(args) &amp;&amp; PyTuple_GET_SIZE(args) == 1 &amp;&amp;
        (kwds == <span class="org-constant">NULL</span> ||
         (PyDict_Check(kwds) &amp;&amp; PyDict_Size(kwds) == 0)))
        <span class="org-keyword">return</span> obj;

    <span class="org-comment-delimiter">/* </span><span class="org-comment">If the returned object is not an instance of type,</span>
<span class="org-comment">       it won't be initialized. </span><span class="org-comment-delimiter">*/</span>
    <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>PyType_IsSubtype(Py_TYPE(obj), type))
        <span class="org-keyword">return</span> obj;

    type = Py_TYPE(obj);
    <span class="org-keyword">if</span> (type-&gt;tp_init != <span class="org-constant">NULL</span>) {
        <span class="org-type">int</span> <span class="org-variable-name">res</span> = type-&gt;tp_init(obj, args, kwds);
        <span class="org-keyword">if</span> (res &lt; 0) {
            assert(PyErr_Occurred());
            Py_DECREF(obj);
            obj = <span class="org-constant">NULL</span>;
        }
        <span class="org-keyword">else</span> {
            assert(<span class="org-negation-char">!</span>PyErr_Occurred());
        }
    }
    <span class="org-keyword">return</span> obj;
}
</pre>
</div>

<p>
如果想深入了解， 可以见 ☞ <a href="https://github.com/python/cpython/blob/3.6/Objects/typeobject.c#L876">Github 源码链接</a>
</p>

<p>
用 <code>Python</code> 进行简单的概述为：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">create_instance</span>(obj_type, *args, **kwargs):
    <span class="org-variable-name">obj</span> = obj_type.__new__(*args, **kwargs)
    <span class="org-keyword">if</span> obj <span class="org-keyword">is</span> <span class="org-keyword">not</span> <span class="org-constant">None</span> <span class="org-keyword">and</span> <span class="org-builtin">issubclass</span>(obj, obj_type):
        obj.__init__(*args, **kwargs)
    <span class="org-keyword">return</span> obj
</pre>
</div>

<p>
首先执行方法 <code>__new__</code>, 然后判断 <b>返回值</b> 的情况：
</p>
<ul class="org-ul">
<li>如果返回值不是 <code>None</code> 同时是 <b>当前类或当前类的子类的实例</b>, 就执行当前类的 <code>__init__</code> 方法</li>
<li>如果返回值不满足以上条件， 就直接返回 <b>返回值</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">ClassA</span>(<span class="org-builtin">object</span>):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">self</span>.name = <span class="org-string">"ClassA's instance"</span>


<span class="org-keyword">class</span> <span class="org-type">ClassB</span>(<span class="org-builtin">object</span>):
    <span class="org-keyword">def</span> <span class="org-function-name">__new__</span>(cls, flag=<span class="org-constant">False</span>):
        <span class="org-keyword">if</span> flag:
            <span class="org-keyword">return</span> <span class="org-builtin">super</span>().__new__(ClassA)
        <span class="org-keyword">else</span>:
            <span class="org-keyword">return</span> <span class="org-builtin">super</span>().__new__(ClassB)

    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, flag=<span class="org-constant">False</span>):
        <span class="org-keyword">self</span>.name = <span class="org-string">"ClassB's instance"</span>


<span class="org-keyword">print</span>(<span class="org-builtin">getattr</span>(ClassA(), <span class="org-string">'name'</span>, <span class="org-string">'Not run __init__.'</span>))
<span class="org-keyword">print</span>(<span class="org-builtin">getattr</span>(ClassB(), <span class="org-string">'name'</span>, <span class="org-string">'Not run __init__.'</span>))
<span class="org-keyword">print</span>(<span class="org-builtin">getattr</span>(ClassB(flag=<span class="org-constant">True</span>), <span class="org-string">'name'</span>, <span class="org-string">'Not run __init__.'</span>))
<span class="org-keyword">print</span>(ClassB(flag=<span class="org-constant">True</span>))

<span class="org-comment-delimiter"># </span><span class="org-comment">ClassA's instance</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">ClassB's instance</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Not run __init__.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&lt;__main__.ClassA object at 0x02493050&gt;</span>
</pre>
</div>

<p>
通过上述代码可以看到， <code>__new__</code> 方法的第一个参数决定了构造的实例的类型。
</p>

<p>
需要注意的是， <code>ClassB</code> 中返回了 <code>ClassA</code> 的实例， 虽然不会执行 <code>ClassB</code> 的构造方法了， 但也不会执行 <code>ClassA</code> 的构造方法。
</p>
</div>
</div>

<div id="outline-container-org4fef4b6" class="outline-2">
<h2 id="org4fef4b6"><span class="section-number-2">4</span> 元类</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>__new__</code> 的一大使用场景就是元类了， 和一般的 <code>__new__</code> 不一样， 由于 <b>元类</b> 的实例是 <b>类</b>, 因此 <b>元类</b> 的 <code>__new__</code> 方法
的参数需要和 <code>type</code> 相符合。
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">TestMetaclass</span>(<span class="org-builtin">type</span>):
    <span class="org-keyword">def</span> <span class="org-function-name">__new__</span>(meta_class, name, base_class, attr_dict):
        <span class="org-keyword">pass</span>
</pre>
</div>

<p>
<b>元类</b> 继承自 <b>type</b>, 其 <code>__new__</code> 方法的几个参数依次为：
</p>
<ul class="org-ul">
<li><code>meta_class</code>, 当前的元类</li>
<li><code>name</code>, 要创建的类的名称</li>
<li><code>base_class</code>, 要创建的类的父类集合</li>
<li><code>attr_dict</code>, 要创建的类的属性字典(方法也是属性)</li>
</ul>

<p>
对于 <b>元类</b> 的具体使用可以查阅相关的资料。
</p>
</div>
</div>

<div id="outline-container-org4fafbd1" class="outline-2">
<h2 id="org4fafbd1"><span class="section-number-2">5</span> 参考链接</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://amir.rachum.com/blog/2016/10/03/understanding-python-class-instantiation/">Understanding Python Class Instantiation</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
